[
    {
       "id":1,
       "category":1,
       "postDate":"2023-05-14",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732078078/61QLmFFtKRL_mjsuwl.jpg",
       "price":9.99,
       "title":"Lawnmower",
       "body":"This powerful lawnmower is designed to make lawn care easier and more efficient. With a robust engine and durable steel deck, it delivers a clean, even cut on all types of grass. Featuring adjustable cutting heights, you can customize the trim to suit your lawn's needs. The large wheels provide smooth maneuverability, while the ergonomic handle ensures comfort during extended use. Whether you're maintaining a small yard or tackling a larger lawn, this lawnmower offers excellent performance and reliability for all your landscaping needs. Ideal for homeowners who value a pristine lawn.",
       "published":true
    },
    {
       "id":2,
       "category":1,
       "postDate":"2023-05-15",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732078461/71aR5dcoAVL_xhvroq.jpg",
       "price":19.99,
       "title":"Weber BBQ",
       "body":"Grill like a pro with the Weber BBQ, designed for ultimate performance and flavor. Built with high-quality stainless steel and a durable porcelain-enameled lid, this BBQ offers excellent heat retention for even cooking. The spacious cooking area provides plenty of room for grilling all your favorites, from burgers to vegetables, while the built-in thermometer ensures precise temperature control. The easily adjustable burners allow for perfect heat distribution, and the rust-resistant frame guarantees longevity. Whether you're hosting a backyard party or cooking for the family, the Weber BBQ delivers exceptional grilling results every time. Perfect for any outdoor chef!",
       "published":true
    },
    {
       "id":3,
       "category":2,
       "postDate":"2023-05-16",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732078595/ps5-pro-dualsense-image-block-01-en-16aug24_lrkdpc.jpg",
       "price":439.99,
       "title":"PS5",
       "body":"Experience next-level gaming with the PlayStation 5 (PS5). Powered by cutting-edge technology, the PS5 delivers lightning-fast load times, stunning graphics, and immersive gameplay like never before. Featuring the ultra-fast SSD, you can jump straight into your favorite games without long wait times. The DualSense wireless controller enhances the experience with haptic feedback and adaptive triggers, offering more immersive and responsive gameplay. With a sleek design and support for 4K resolution, the PS5 is perfect for gamers who demand the best. Elevate your gaming experience today with the PS5, where every game feels like a masterpiece.",
       "published":true
    },
    {
       "id":4,
       "category":2,
       "postDate":"2023-05-17",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732078725/61QKAlzPSfL_tihwzg.jpg",
       "price":459.99,
       "title":"XBOX",
       "body":"The Xbox Series S offers an incredible gaming experience at an affordable price. With its compact design and powerful performance, this next-gen console delivers fast load times, smooth gameplay, and stunning graphics in up to 1440p resolution. The custom SSD ensures quick transitions between games, and with Xbox Game Pass, you get access to hundreds of games at your fingertips. The Xbox Series S is perfect for those who want high-quality gaming without the bulk. Upgrade your gaming setup with the Xbox Series S and enjoy a seamless, immersive gaming experience.",
       "published":true
    },
    {
       "id":5,
       "category":3,
       "postDate":"2023-05-18",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732078813/CS2056_Female_OversizedOrganicT-Shirt-MarineBlue_1_u2x7p3.jpg",
       "price":39.99,
       "title":"TShirt",
       "body":"This soft, comfortable T-shirt is a wardrobe essential that combines style and comfort. Made from high-quality cotton, it offers a breathable, lightweight feel that's perfect for all-day wear. The classic fit provides a flattering look for any body type, while the durable fabric ensures long-lasting use. Whether you're dressing up for a casual outing or lounging at home, this T-shirt is versatile enough to pair with any outfit. Available in a variety of colors and sizes, it's the perfect addition to any wardrobe. Comfortable, stylish, and built to last – get yours today!",
       "published":true
    },
    {
       "id":6,
       "category":3,
       "postDate":"2023-05-19",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732078872/BlackShortsFrontFinal2_1_1024x1024_losfjn.jpg",
       "price":29.99,
       "title":"Shorts",
       "body":"These athletic shorts are designed for maximum comfort and performance. Made from lightweight, breathable fabric, they keep you cool and dry during intense workouts or casual wear. The stretchy material offers full range of motion, making them perfect for running, training, or outdoor activities. Featuring an adjustable waistband for a secure fit, along with deep pockets for convenience, these shorts provide both functionality and style. Whether you're hitting the gym or relaxing at home, these athletic shorts are a must-have for active individuals. Stay comfortable and look great – get your pair today!",
       "published":true
    },
    {
       "id":7,
       "category":4,
       "postDate":"2023-05-20",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732078939/1200px-Baseball__28crop_29_ribrhz.jpg",
       "price":19.99,
       "title":"Baseball",
       "body":"This premium baseball is crafted for durability and optimal performance, making it perfect for both casual play and competitive games. With a traditional leather cover and raised seams, it offers excellent grip and control, whether you're pitching, catching, or hitting. The resilient construction ensures long-lasting use, while the professional-quality stitching enhances its shape and consistency. Whether you're practicing your swing or playing in a league, this baseball delivers a true feel and reliable performance. Ideal for players of all levels, this baseball is your go-to choice for every game. Grab yours today and take your game to the next level!",
       "published":true
    },
    {
       "id":8,
       "category":4,
       "postDate":"2023-05-21",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732078997/ub66_ys02rg.jpg",
       "price":99.99,
       "title":"Soccer Ball",
       "body":"This high-quality soccer ball is designed for optimal performance on the field. Made with durable, synthetic leather and reinforced stitching, it offers excellent control, accuracy, and long-lasting use. The textured surface enhances grip, making it easier to handle, pass, and shoot with precision. Whether you're playing a casual game with friends or competing at a higher level, this soccer ball delivers a consistent, reliable bounce and superior durability. Available in vibrant designs and sizes for all ages, it's the perfect choice for any soccer enthusiast. Elevate your game with this top-tier soccer ball!",
       "published":true
    },
    {
       "id":9,
       "category":5,
       "postDate":"2023-05-16",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732079045/PEDIGREE-Complete-Nutrition-Grilled-Steak-Vegetable-Dry-Dog-Food-for-Adult-Dog-18-lb-Bag_3fb06e75-97a0-49a6-abc0-bd729e35b502.ddbefbe3d677471ceff840699c433b8e_xbhqxw.jpg",
       "price":99.99,
       "title":"Dog Food",
       "body":"Pedigree Complete Nutrition Dog Food provides a balanced, wholesome meal for your furry friend. Packed with high-quality protein from chicken, beef, or lamb, it supports strong muscles and energy for active dogs. This formula includes essential vitamins and minerals to promote healthy digestion, a shiny coat, and a strong immune system. With a blend of fiber and natural ingredients, it helps maintain a healthy weight and overall well-being. Pedigree’s tasty and nutritious kibble is perfect for dogs of all sizes and ages, ensuring they get the essential nutrients they need to live a happy, healthy life. Treat your dog to the nutrition they deserve with Pedigree!",
       "published":true
    },
    {
       "id":10,
       "category":5,
       "postDate":"2023-05-16",
       "featureImage":"https://res.cloudinary.com/dogdadxjy/image/upload/v1732079112/1031502_zgqdm4.jpg",
       "price":9.99,
       "title":"Fish Food",
       "body":"TetraMin Tropical Flakes Fish Food provides your aquarium fish with a nutritious and balanced diet. Made with high-quality ingredients, these easy-to-feed flakes are rich in vitamins, minerals, and essential nutrients to support healthy growth, vibrant color, and a strong immune system. Designed for tropical fish, the formula ensures optimal digestion and promotes overall well-being. TetraMin flakes float on the water’s surface, allowing fish to easily consume them. Whether you have goldfish, guppies, or tetras, this premium fish food is perfect for keeping your aquatic pets healthy and thriving. Feed your fish the best with TetraMin Tropical Flakes!",
       "published":true
    }
 ] 